In [1]:
# importing pandas library as pd

import pandas as pd

# importing application_record dataset

In [2]:
# Reading application_record.csv file.
# This application_record.csv could be downloaded from the below provided link
# https://drive.google.com/file/d/1EJ454SyXT-RpEAfhqYu72bCyvZrY_ehg/view?usp=sharing
def read_app_data():
    application_data=pd.read_csv('application_record.csv')
    return application_data

## importing credit_card dataset

In [3]:
# This credit_record.csv could be downloaded from the below provided link
# https://drive.google.com/file/d/1LvjYFEztJJUYNhSa1eznfseCNHz3DgZb/view?usp=sharing
credit_record=pd.read_csv('credit_record.csv')

## Feature creation

In [4]:
application_data=read_app_data()
application_data.head()

,ID,CODE_GENDER,FLAG_OWN_CAR,FLAG_OWN_REALTY,CNT_CHILDREN,AMT_INCOME_TOTAL,NAME_INCOME_TYPE,NAME_EDUCATION_TYPE,NAME_FAMILY_STATUS,NAME_HOUSING_TYPE,DAYS_BIRTH,DAYS_EMPLOYED,FLAG_MOBIL,FLAG_WORK_PHONE,FLAG_PHONE,FLAG_EMAIL,OCCUPATION_TYPE,CNT_FAM_MEMBERS
0,5008804,M,Y,Y,0,427500.0,Working,Higher education,Civil marriage,Rented apartment,-12005,-4542,1,1,0,0,NaN,2.0
1,5008805,M,Y,Y,0,427500.0,Working,Higher education,Civil marriage,Rented apartment,-12005,-4542,1,1,0,0,NaN,2.0
2,5008806,M,Y,Y,0,112500.0,Working,Secondary / secondary special,Married,House / apartment,-21474,-1134,1,0,0,0,Security staff,2.0
3,5008808,F,N,Y,0,270000.0,Commercial associate,Secondary / secondary special,Single / not married,House / apartment,-19110,-3051,1,0,1,1,Sales staff,1.0
4,5008809,F,N,Y,0,270000.0,Commercial associate,Secondary / secondary special,Single / not married,House / apartment,-19110,-3051,1,0,1,1,Sales staff,1.0

In [5]:
application_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 438557 entries, 0 to 438556
Data columns (total 18 columns):
 #   Column               Non-Null Count   Dtype
---  ------               --------------   -----
 0   ID                   438557 non-null  int64
 1   CODE_GENDER          438557 non-null  object
 2   FLAG_OWN_CAR         438557 non-null  object
 3   FLAG_OWN_REALTY      438557 non-null  object
 4   CNT_CHILDREN         438557 non-null  int64
 5   AMT_INCOME_TOTAL     438557 non-null  float64
 6   NAME_INCOME_TYPE     438557 non-null  object
 7   NAME_EDUCATION_TYPE  438557 non-null  object
 8   NAME_FAMILY_STATUS   438557 non-null  object
 9   NAME_HOUSING_TYPE    438557 non-null  object
 10  DAYS_BIRTH           438557 non-null  int64
 11  DAYS_EMPLOYED        438557 non-null  int64
 12  FLAG_MOBIL           438557 non-null  int64
 13  FLAG_WORK_PHONE      438557 non-null  int64
 14  FLAG_PHONE           438557 non-null  int64
 15  FLAG_EMAIL           438557 non-null  int64
 16  OCCUPATION_TYPE      304354 non-null  object
 17  CNT_FAM_MEMBERS      438557 non-null  float64
dtypes: float64(2), int64(8), object(8)
memory usage: 60.2+ MB

### Here columns like ID and DAYS_BIRTH are not relatable to datasets so we could these columns

In [6]:
def feature_creation():
    application_data.drop(['ID','DAYS_BIRTH'],axis=1,inplace=True)
    
#     Checking for columns with data type as 'object'

    object_type_columns=[col for col in application_data.columns if application_data[col].dtype=='object'] 
    
#     Converting the object type data to categorical form.
    
    for i,column in enumerate(object_type_columns):
        application_data[column]=pd.Categorical(application_data[column]).codes
    features_column=application_data.columns
    features=pd.DataFrame(application_data,columns=features_column)
    return features

In [7]:
features_for_model=feature_creation()

In [8]:
# Observing first 5 values of feature

features_for_model.head()

,CODE_GENDER,FLAG_OWN_CAR,FLAG_OWN_REALTY,CNT_CHILDREN,AMT_INCOME_TOTAL,NAME_INCOME_TYPE,NAME_EDUCATION_TYPE,NAME_FAMILY_STATUS,NAME_HOUSING_TYPE,DAYS_EMPLOYED,FLAG_MOBIL,FLAG_WORK_PHONE,FLAG_PHONE,FLAG_EMAIL,OCCUPATION_TYPE,CNT_FAM_MEMBERS
0,1,1,1,0,427500.0,4,1,0,4,-4542,1,1,0,0,-1,2.0
1,1,1,1,0,427500.0,4,1,0,4,-4542,1,1,0,0,-1,2.0
2,1,1,1,0,112500.0,4,4,1,1,-1134,1,0,0,0,16,2.0
3,0,0,1,0,270000.0,0,4,3,1,-3051,1,0,1,1,14,1.0
4,0,0,1,0,270000.0,0,4,3,1,-3051,1,0,1,1,14,1.0